PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
int up_bdshot_num_erpm_ready(void)
{
	int num_ready = 0;

	for (unsigned i = 0; i < MAX_TIMER_IO_CHANNELS; ++i) {
		if (_telem_channels[i].data.fields.erpm.ready) {
			++num_ready;
		}
	}

	return num_ready;
}

int up_bdshot_get_erpm(uint8_t output_channel, int *erpm)
{
	uint8_t timer_index = timer_io_channels[output_channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	if (channel_initialized) {
		*erpm = _telem_channels[output_channel].data.fields.erpm.value;
		// _telem_channels[output_channel].data.fields.erpm.ready = false; does this lead to a race condition?
		return PX4_OK;
	}

	// this channel is not configured for dshot
	return PX4_ERROR;
}

int up_bdshot_channel_status(uint8_t channel)
{
	uint8_t timer_index = timer_io_channels[channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	// TODO: track that each channel is communicating using the decode stats
	if (channel_initialized) {
		return 1;
	}

	return 0;
}

void up_bdshot_status(void)
{
	PX4_INFO("dshot driver stats:");

	if (_bidirectional) {
		PX4_INFO("Bidirectional DShot enabled");
	}

	uint8_t timer_index = _bidi_timer_index;

	for (uint8_t timer_channel_index = 0; timer_channel_index < MAX_NUM_CHANNELS_PER_TIMER; timer_channel_index++) {
		bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

		if (channel_initialized) {
			PX4_INFO("tmr %u, ch %u: read %lu, erpm %lu, #tel %lu, failed nibble %lu, failed CRC %lu, invalid/zero %lu, #fe %lu",
				 timer_index, timer_channel_index,
				 read_ok[timer_channel_index],
				 read_erpm[timer_channel_index],
				 read_ext_tel[timer_channel_index],
				 read_fail_nibble[timer_channel_index],
				 read_fail_crc[timer_channel_index],
				 read_fail_zero[timer_channel_index],
				 read_fail_ext[timer_channel_index]);


#if DSHOT_STATUS_PRINT_EXTENDED
			uint8_t output_channel = output_channel_from_timer_channel(timer_index, timer_channel_index);
			int32_t last_erpm_raw = _telem_channels[output_channel].data.fields.erpm.ready ? _telem_channels[output_channel].data.fields.erpm.value : -1;
			int32_t last_temp_raw = _telem_channels[output_channel].data.fields.temperature.ready ? _telem_channels[output_channel].data.fields.temperature.value : -1;
			int32_t last_battery_voltage_raw = _telem_channels[output_channel].data.fields.battery_voltage.ready ? _telem_channels[output_channel].data.fields.battery_voltage.value : -1;
			int32_t last_current_raw = _telem_channels[output_channel].data.fields.current.ready ? _telem_channels[output_channel].data.fields.current.value : -1;

			int erpm_count = _telem_channels[output_channel].data.fields.erpm.count;
			int temperature_count = _telem_channels[output_channel].data.fields.temperature.count;
			int battery_voltage_count = _telem_channels[output_channel].data.fields.battery_voltage.count;
			int current_count = _telem_channels[output_channel].data.fields.current.count;

			PX4_INFO("erpm_raw %d (%d) tmp_raw %d (%d), bat_raw %d (%d), curr_raw %d (%d)",
				  (int)last_erpm_raw, erpm_count,
				  (int)last_temp_raw, temperature_count,
				  (int)last_battery_voltage_raw, battery_voltage_count,
				  (int)last_current_raw, current_count);
#endif

		}
	}
}

int up_bdshot_get_extended_telemetry(uint8_t output_channel, dshot_telemetry_field_t field, int32_t *value)
{
	// check if the value pointer is valid
	if (value == NULL) {
		return PX4_ERROR;
	}

	// check if the output_channel is valid
	if (output_channel >= MAX_TIMER_IO_CHANNELS) {
		return PX4_ERROR;
	}

	// check if the channel is initialized
	if(!up_bdshot_channel_status(output_channel)) {
		return PX4_ERROR;
	}

	unsigned field_index = (int)field;

	dshot_channel_data_t *channel_data = &_telem_channels[output_channel];

	// check array bounds
	const unsigned num_fields = sizeof(channel_data->data.as_array)
		/ sizeof(channel_data->data.as_array[0]);

	if (field_index >= num_fields) {
		return PX4_ERROR;
	}

	if(!channel_data->data.as_array[field_index].ready) {
		return PX4_ERROR; // value not ready
	}

	*value = channel_data->data.as_array[field_index].value;
	return PX4_OK;
}

uint8_t nibbles_from_mapped(uint8_t mapped)
{
	switch (mapped) {
	case 0x19:
		return 0x00;

	case 0x1B:
		return 0x01;

	case 0x12:
		return 0x02;

	case 0x13:
		return 0x03;

	case 0x1D:
		return 0x04;

	case 0x15:
		return 0x05;

	case 0x16:
		return 0x06;

	case 0x17:
		return 0x07;

	case 0x1a:
		return 0x08;

	case 0x09:
		return 0x09;

	case 0x0A:
		return 0x0A;

	case 0x0B:
		return 0x0B;

	case 0x1E:
		return 0x0C;

	case 0x0D:
		return 0x0D;

	case 0x0E:
		return 0x0E;

	case 0x0F:
		return 0x0F;

	default:
		// Unknown mapped
		return 0xFF;
	}
}

static bool decode_telemetry(uint8_t timer_index, uint8_t channel_index, dshot_telemetry_result_t* result)
{
	if (result == NULL) {
		return false;
	}


	uint32_t value = 0;
	uint32_t high = 1; // We start off with high
	unsigned shifted = 0;

	// We can ignore the very first data point as it's the pulse before it starts.
	unsigned previous = dshot_capture_buffer[channel_index][1];

	// Loop through the capture buffer for the specified channel
	for (unsigned i = 2; i < CHANNEL_CAPTURE_BUFF_SIZE; ++i) {

		if (dshot_capture_buffer[channel_index][i] == 0) {
			// Once we get zeros we're through
			break;
		}

		// This seemss to work with dshot 150, 300, 600, 1200
		// The values were found by trial and error to get the quantization just right.
		const uint32_t bits = (dshot_capture_buffer[channel_index][i] - previous + 5) / 20;

		// Convert GCR encoded pulse train into value
		for (unsigned bit = 0; bit < bits; ++bit) {
			value = (value << 1) | high;
			++shifted;
		}

		// The next edge toggles.
		high = !high;

		previous = dshot_capture_buffer[channel_index][i];
	}

	if (shifted == 0) {
		// no data yet, or this time
		++read_fail_zero[channel_index];
		return false;
	}

	// We need to make sure we shifted 21 times. We might have missed some low "pulses" at the very end.
	value <<= (21 - shifted);

	// From GCR to eRPM according to:
	// https://brushlesswhoop.com/dshot-and-bidirectional-dshot/#erpm-transmission
	unsigned gcr = (value ^ (value >> 1));

