PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	uint32_t data = 0;

	// 20bits -> 5 mapped -> 4 nibbles
	for (unsigned i = 0; i < 4; ++i) {
		uint32_t nibble = nibbles_from_mapped(gcr & 0x1F) << (4 * i);

		if (nibble == 0xFF) {
			++read_fail_nibble[channel_index];
			return false;
		}

		data |= nibble;
		gcr >>= 5;
	}

	// Check for CRC errors
	unsigned crc = data & 0xF;

	unsigned payload = (data & 0xFFF0) >> 4;
	unsigned calculated_crc = (~(payload ^ (payload >> 4) ^ (payload >> 8))) & 0x0F;

	if (crc != calculated_crc) {
		++read_fail_crc[channel_index];
		return false;
	}

	++read_ok[channel_index];


#if DSHOT_ALLOW_EXTENDED_TEL
	unsigned mantissa = payload & 0x01FF;
	// if the msb of the mantissa is zero, then this is an extended telemetry packet
	bool is_telemetry = (mantissa & 0x0100) == 0;

	if(is_telemetry)
	{
		result->value = mantissa & 0xff; // extended telemetry value is 8 bits wide

		unsigned telemetry_key = payload & 0x0E00;
		uint8_t telemetry_index = telemetry_key >> 9;
		if (telemetry_index > DShot_telemetry_field_evt) {
			// Unknown telemetry key
			read_fail_ext[channel_index]++;
			return false;
		}

		result->type = telemetry_key;
		read_ext_tel[channel_index]++;

		return true;
	}
#endif

	// If we get here, this is an eRPM telemetry packet, either because we treat all
	// as erpm, or because the extended telemetry bit is false.
	unsigned shift = (data & 0xE000) >> 13;
	unsigned period = ((data & 0x1FF0) >> 4) << shift;

	result->type = DShot_telemetry_ext_key_none; // Default to eRPM telemetry type
	result->value = period;

	return true;
}

#endif
